#+TITLE: Dropbox as a systemd service

Source: https://www.bbkane.com/blog/dropbox-as-a-systemd-service/

# Last used for Fedora 37

To see Dropbox settings, one may need to =dropbox stop= and =dropbox start=  manually in terminal to for it to appear in the top bar to be right clicked.

* Tangle the following
Write the following to =~/.config/systemd/user/dropbox.service=
#+begin_src shell :tangle  ~/.config/systemd/user/dropbox.service :mkdirp yes
[Unit]
Description=Dropbox as a user service
After=local-fs.target network.target

[Service]
Type=simple
ExecStart=%h/.dropbox-dist/dropboxd
Restart=on-failure
RestartSec=1
# Note: don't set these in user mode- they're already set, and
# systemd won't have permission to set them- killing your service before
# it starts
# User=%U
# Group=%U

[Install]
WantedBy=default.target
#+end_src

* Start the service
#+begin_src shell
systemctl --user start dropbox
#+end_src

#+RESULTS:

* Make sure it worked with:
#+begin_src shell :results output code
7systemctl --user status dropbox.service
#+end_src


* Check the logs
In my (limited) experience, Dropbox tends to be a quiet service, as checking the logs with journalctl doesn't really produce much
#+begin_src shell
journalctl -u dropbox
#+end_src

#+RESULTS:
: -- No entries --

* Finally, make sure the service starts on login
#+begin_src shell
systemctl --user enable dropbox
#+end_src

#+RESULTS:
